w7/w7d1/pokedex_app/app/views/pokemon/_pokemon.json.jbuilder

SELECT "toys".* FROM "toys"  WHERE "toys"."pokemon_id" = $1  [["pokemon_id", 129]]
---
if display_toys
  json.toys pokemon.toys.each do |toy|